# 16 -

# 請使用迴圈 (while loop 或 for loop)
# 繪製三種不同的圖形
# 圖形請考範例測資

# ---------------------------------------------------

# 輸入說明 :
# 第一行，輸入整數 1 or 2 or 3，代表接下來要畫的圖形種類
# 第一種圖形為 三角形尖方面向右邊 (參考 範例輸出 1 or https://ppt.cc/fMFokx)
# 第二種圖形為 三角形尖方面向左邊 (參考 範例輸出 2 or https://ppt.cc/fhcJ8x)
# 第三種圖形為 菱形 (參考 範例輸出 3 or https://ppt.cc/fE35Nx)

# 第二行，輸入整數 N ，代表這個圖形有N行(僅接受奇數)


# 輸出說明 :
# 根據輸入，畫出對應的圖形
# 若整數N不是奇數，則改為輸出ERROR，並結束程式

# 此題不考慮第一行輸入1,2,3以外的情況

# ---------------------------------------------------

# 範例輸入1:
# 1
# 7

# 範例輸出 1:
# *
# **
# ***
# ****
# ***
# **
# *

# —--------------------------------------------------

# 範例輸入2:
# 2
# 5

# 範例輸出 2:
# ..*
# .**
# ***
# .**
# ..*

# —--------------------------------------------------

# 範例輸入3:
# 3
# 3

# 範例輸出 3:
# .*.
# ***
# .*.

# —--------------------------------------------------

# 範例輸入4:
# 1
# 4

# 範例輸出 4:
# ERROR

graph = int(input())
lines = int(input())

if (lines % 2 == 1):
    star = lines // 2 + 1
    if (lines > 2 and lines < 22 and (lines % 2 != 0)):
        if(graph == 1):
            for i in range(1, star + 1):
                print("*" * i)
            for i in range(star - 1, 0, -1):
                print("*" * i)

        elif(graph == 2):
            for i in range(1, star + 1):
                print("." * (star - i) + "*" * i)
            for i in range(star - 1, 0, -1):
                print("." * (star - i) + "*" * i)

        elif(graph == 3):
            for i in range(1, star + 1):
                print("." * (star - i) + "*"*(i*2 - 1)+ "."*(i*-1 + 2))
            for i in range(star - 1, 0, -1):
                print("." * (star - i) + "*"*(i*2 - 1)+ "."*(i*2 - 1))
else:
    print("ERROR")