# 17 -
# 繪製三種不同的圖形，每個圖形都有大小 N (3 <= N <= 50)，代表這個圖有N行

# 第一種圖形為 直角三角形
# 例如:
# N = 5
# 輸出圖形為:
# 1
# 121
# 12321
# 1234321
# 123454321

# 第二種圖形為正三角形 (頂端朝上之三角形)
# 例如:
# N = 4
# 輸出圖形為:
# ___1___
# __121__
# _12321_
# 1234321

# 第三種圖形為倒三角形 (頂端朝下肢三角形)
# 例如:
# N = 4
# 輸出圖形為:
# 1234321
# _12321_
# __121__
# ___1___


# ---------------------------------------------------

# 輸入說明 :
# 第一行，輸入整數 1 or 2 or 3，代表接下來要畫的圖形種類
# 若第一行輸入的整數為1, 2, 3 以外的數字，則直接結束程式，不必輸出任何字串與圖形

# 第一種圖形為 直角三角形 (參考 範例輸出 1、範例輸出 2)
# 第二種圖形為 正三角形 (參考 範例輸出 3、範例輸出 4)
# 第三種圖形為 倒三角形 (參考 範例輸出 5、範例輸出 6)

# 第二行，輸入整數 N ， 3 <= N <= 50，代表這個圖有N行


# 輸出說明 :
# 根據輸入，畫出對應的圖形
# 輸出圖形為數字+底線

# ---------------------------------------------------

# 範例輸入 1: (https://ppt.cc/fUEeEx)
# 1
# 5

# 範例輸出 1:
# 1
# 121
# 12321
# 1234321
# 123454321

# ---------------------------------------------------

# 範例輸入 2: (https://ppt.cc/fnJd3x)
# 1
# 8


# 範例輸出 2:
# 1
# 121
# 12321
# 1234321
# 123454321
# 12345654321
# 1234567654321
# 123456787654321

# ---------------------------------------------------

# 範例輸入 3: (https://ppt.cc/ffGjLx)
# 2
# 4

# 範例輸出 3:
# ___1___
# __121__
# _12321_
# 1234321

# ---------------------------------------------------

# 範例輸入 4: (https://ppt.cc/f4pQLx)
# 2
# 6

# 範例輸出 4:
# _____1_____
# ____121____
# ___12321___
# __1234321__
# _123454321_
# 12345654321

# ---------------------------------------------------

# 範例輸入 5: (https://ppt.cc/fLhIGx)
# 3
# 3

# 範例輸出 5:
# 12321
# _121_
# __1__

# ---------------------------------------------------

# 範例輸入 6: (https://ppt.cc/fPZDcx)
# 3
# 4

# 範例輸出 6:
# 1234321
# _12321_
# __121__
# ___1___


def main():
    shape = int(input())
    rows = int(input())
    picture(shape,rows)

def picture(x,y):
    if (x==1):
        for i in range(1, y+1):
            for j in range(1,i+1):
                print(j, end='')
    
            for j in range(i-1,0,-1):
                print(j, end='')
            print("")

    elif (x==2):
        for i in range(1,y+1):
            for j in range(1, y+1-i):
                print('_', end='')
            for j in range(1,i+1):
                print(j, end='')
            for j in range(i-1,0,-1):
                print(j, end='')
            for j in range(1, y+1-i):
                print('_', end='')
            print()

    elif (x==3):        
        for i in range(y,0, -1):
            for j in range(y-i):
                print('_', end='') 
            for j in range(1,i+1):
                print(j, end='')
            for j in range(i-1,0,-1):
                print(j, end='')
            for j in range(y-i):
                print('_', end='')
            print()

main()
    