# 20 -

# 給一個正整數 (2 <= N <= 10000)，請找出2~N之間所有質數的總和

# ---------------------------------------------------

# 輸入說明 :
# 第一行，輸入整數 N (2 <= N <= 10000)

# 輸出說明 :
# 輸出 2~N 之間所有質數的總和

# ---------------------------------------------------

# 範例輸入 1說明 :
# 2

# 範例輸出 1說明 :
# 2 (2~2之間的質數共有2，因此總和為2)

# ---------------------------------------------------

# 範例輸入 2說明 :
# 100

# 範例輸出 2說明 :
# 1060 (2~100之間的質數共有[2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31, 37, 41, 43, 47, 53, 59, 61, 67, 71, 73, 79, 83, 89, 97]，總和為1060)

# ---------------------------------------------------

# 範例輸入 1:
# 2

# 範例輸出 1:
# 2

# ---------------------------------------------------

# 範例輸入 2:
# 100

# 範例輸出 2:
# 1060

# ---------------------------------------------------

# 範例輸入 3:
# 10000

# 範例輸出 3:
# 5736396

def nomorPrima(num):
    if num < 2:
        return False
    for j in range(2, num):
        if (num % j) == 0:
            return False
    return True

def logika(maximum):
    sum = 0
    for i in range(2, maximum+1, 1):
        if nomorPrima(i):
            sum += i
    return sum

def main():
    maximum = input()

    try:
        maximum = int(maximum)
    except:
        print("Inputs are not ints!")

    if (maximum < 2 or maximum > 10000):
        return

    print(logika(maximum))

if __name__ == '__main__':
    main()