005.
計算BMI
輸入身高(公分) 體重(公斤) (皆使用小數)

BMI = 體重(公斤) / (身高*身高)(公尺)

# 結果須輸出到小數點第一位
# print("%.1f" %bmi)

# ---------------------------------------------------

# 輸入說明：
# 第一行輸入身高 (公分)
# 第二行輸入體重 (公斤)

# 輸出說明：
# 輸出僅一行，為BMI的數值，結果輸出到小數點後第一位

# ---------------------------------------------------

# Example Input 1:
# 172.2
# 60.7

# Example Output 1:
# 20.5

# ---------------------------------------------------

# Example Input 2:
# 165.1
# 70.4

# Example Output 2:
# 25.8

# ---------------------------------------------------

# Example Input 3:
# 189.2
# 100.0

# Example Output 3:
# 27.9

# ---------------------------------------------------

# Example Input 4:
# 173.4
# 56.7

# Example Output 4:
# 18.9

h = float(input())/100
w = float(input())

bmi = w/(h*h)
print("%.1f"%bmi)