# 010. 撲克牌
# A, 2, 3, 4, 5, 6, 7, 8, 9, 10, J, Q, K
# A~10 點數為 1~10，J, K, Q 為 0.5。
# 玩家A, B 兩個人，各發三張撲克牌，加總點數越接近 10.5 的贏；
# 如果總點數相同，則雙方平手 (Tie)
# 總點數超過 10.5 (不含10.5) ，爆掉且分數為 0。

# -------------------------------------------------------------------

# 輸入說明:
# 第一 ~ 三行，輸入 玩家 A 的三張撲克牌
# 第四 ~ 六行，輸入 玩家 B 的三張撲克牌

# 輸出說明:
# 第一行輸出 玩家 A 的總點數
# 第二行輸出 玩家 B 的總點數
# 第三行，如果玩家A獲勝，輸出 A Win；如果玩家B獲勝，輸出 B Win；若雙方平手，輸出 Tie

# -------------------------------------------------------------------

# 範例輸入 1 說明:
# A (玩家A的 第一張 撲克牌為 A)
# 2 (玩家A的 第二張 撲克牌為 2)
# 3 (玩家A的 第三張 撲克牌為 3)
# 2 (玩家B的 第一張 撲克牌為 2)
# 3 (玩家B的 第一張 撲克牌為 3)
# 4 (玩家B的 第一張 撲克牌為 4)

# 範例輸出 1 說明:
# 6 (玩家A的總點數為 1 + 2 + 3 = 6)
# 9 (玩家B的總點數為 2 + 3 + 4 = 9)
# B Win (9 > 6，玩家B獲勝，輸出B Win)

# -------------------------------------------------------------------

# Example Input 1：
# A
# 2
# 3
# 2
# 3
# 4

# Example Output：
# 6
# 9
# B Win

# -------------------------------------------------------------------

# Example Input 2：
# A
# 2
# 3
# A
# 2
# 3
# Example Output 2：
# 6
# 6
# Tie

# -------------------------------------------------------------------

# Example Input 3：
# 2
# 3
# 5
# 4
# A
# 2

# Example Output 3：
# 10
# 7
# A Win

# -------------------------------------------------------------------

# Example Input 4：
# 10
# 9
# 8
# 8
# 9
# 10

# Example Output 4：
# 0
# 0
# Tie

# -------------------------------------------------------------------

# Example Input 5：
# 2
# 3
# 6
# 2
# 3
# 5

# Example Output 5：
# 0
# 10
# B Win

import math
def main():
    score_dict = {"A":1, "2":2, "3":3, "4":4, "5":5, "6":6, "7":7, "8":8, "9":9, "10":10, "J":0.5, "Q":0.5, "K":0.5}
    A1 = score_dict[input()]
    A2 = score_dict[input()]
    A3 = score_dict[input()]
    B1 = score_dict[input()]
    B2 = score_dict[input()]
    B3 = score_dict[input()]
    score_A = A1 + A2 + A3
    score_B = B1 + B2 + B3
    overscore(score_A)
    overscore(score_B)
    judge(overscore(score_A),overscore(score_B))
    
def overscore(x):
    if (x > 10.5):
        return 0
    else :
        return x

def judge(y1,y2):
    print (y1)
    print (y2)
    if (y1 > y2):
        print("A Win")
    elif (y2 > y1):
        print("B Win")
    elif ( y1 == y2):
        print("Tie")
main()